; domain
(define (domain blocks)

    (:requirements :strips :typing)

    (:types block)

    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )

    (:action pick-up
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x))
    )

    (:action put-down
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x))
    )

    (:action stack
        :parameters (?x - block ?y - block)
        :precondition (and (holding ?x) (clear ?y))
        :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y))
    )

    (:action unstack
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y)))
    )
)

; problem
(define (problem blocks-prob-10)
  (:domain blocks)

  (:objects
    b1 - block
    b2 - block
    b3 - block
    b4 - block
    b5 - block
    b6 - block
    b7 - block
    b8 - block
    b9 - block
    b10 - block
    b11 - block
    b12 - block
    b13 - block
    b14 - block
    b15 - block
    b16 - block
    b17 - block
    b18 - block
    b19 - block
    b20 - block
  )

  (:init
    (ontable b20)
    (on b18 b20)
    (ontable b7)
    (on b16 b7)
    (ontable b10)
    (on b8 b10)
    (ontable b1)
    (ontable b9)
    (ontable b12)
    (ontable b15)
    (ontable b17)
    (ontable b14)
    (ontable b13)
    (ontable b6)
    (ontable b19)
    (ontable b5)
    (ontable b4)
    (ontable b11)
    (ontable b3)
    (ontable b2)
    (clear b18)
    (clear b16)
    (clear b8)
    (clear b1)
    (clear b9)
    (clear b12)
    (clear b15)
    (clear b17)
    (clear b14)
    (clear b13)
    (clear b6)
    (clear b19)
    (clear b5)
    (clear b4)
    (clear b11)
    (clear b3)
    (clear b2)
    (handempty)
  )

  (:goal (and
    (ontable b15)
    (on b2 b15)
    (ontable b14)
    (on b1 b14)
    (ontable b5)
    (on b3 b5)
    (ontable b10)
    (on b8 b10)
    (ontable b17)
    (on b4 b17)
    (ontable b20)
    (on b6 b20)
    (ontable b19)
    (on b13 b19)
    (ontable b12)
    (on b16 b12)
    (ontable b7)
    (on b18 b7)
    (ontable b11)
    (on b9 b11)
  ))
)

; plan
1. (pick-up b13)
   deleted: (ontable b13) (clear b13) (handempty)
   added: (holding b13)
   goals met: 11 of 20
2. (stack b13 b19)
   deleted: (holding b13) (clear b19)
   added: (clear b13) (handempty) (on b13 b19)
   goals met: 12 of 20
3. (unstack b16 b7)
   deleted: (clear b16) (handempty) (on b16 b7)
   added: (holding b16) (clear b7)
   goals met: 12 of 20
4. (stack b16 b12)
   deleted: (holding b16) (clear b12)
   added: (clear b16) (handempty) (on b16 b12)
   goals met: 13 of 20
5. (unstack b18 b20)
   deleted: (clear b18) (handempty) (on b18 b20)
   added: (holding b18) (clear b20)
   goals met: 13 of 20
6. (stack b18 b7)
   deleted: (holding b18) (clear b7)
   added: (clear b18) (handempty) (on b18 b7)
   goals met: 14 of 20
7. (pick-up b2)
   deleted: (ontable b2) (clear b2) (handempty)
   added: (holding b2)
   goals met: 14 of 20
8. (stack b2 b15)
   deleted: (holding b2) (clear b15)
   added: (clear b2) (handempty) (on b2 b15)
   goals met: 15 of 20
9. (pick-up b3)
   deleted: (ontable b3) (clear b3) (handempty)
   added: (holding b3)
   goals met: 15 of 20
10. (stack b3 b5)
   deleted: (holding b3) (clear b5)
   added: (clear b3) (handempty) (on b3 b5)
   goals met: 16 of 20
11. (pick-up b4)
   deleted: (ontable b4) (clear b4) (handempty)
   added: (holding b4)
   goals met: 16 of 20
12. (stack b4 b17)
   deleted: (holding b4) (clear b17)
   added: (clear b4) (handempty) (on b4 b17)
   goals met: 17 of 20
13. (pick-up b6)
   deleted: (ontable b6) (clear b6) (handempty)
   added: (holding b6)
   goals met: 17 of 20
14. (stack b6 b20)
   deleted: (holding b6) (clear b20)
   added: (clear b6) (handempty) (on b6 b20)
   goals met: 18 of 20
15. (pick-up b9)
   deleted: (ontable b9) (clear b9) (handempty)
   added: (holding b9)
   goals met: 18 of 20
16. (stack b9 b11)
   deleted: (holding b9) (clear b11)
   added: (clear b9) (handempty) (on b9 b11)
   goals met: 19 of 20
17. (pick-up b1)
   deleted: (ontable b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 19 of 20
18. (stack b1 b14)
   deleted: (holding b1) (clear b14)
   added: (clear b1) (handempty) (on b1 b14)
   goals met: 20 of 20
